Repository: adelino-masioli/extractor-pro
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pt

source: The content from "%(source)s" does not appear to be a valid PDF.
pt: O conteúdo de "%(source)s" não parece ser um PDF válido.

source: The PDF from "%(source)s" is password protected and cannot be processed.
pt: O PDF de "%(source)s" está protegido por senha e não pode ser processado.

source: No extractable text found in the PDF "%(source)s". It might be an image file, empty, or contain only graphics.
pt: Nenhum texto extraível encontrado no PDF "%(source)s". Pode ser um ficheiro de imagem, estar vazio ou conter apenas gráficos.

source: Invalid or corrupted PDF file from "%(source)s": %(error)s
pt: Ficheiro PDF inválido ou corrompido de "%(source)s": %(error)s

source: Invalid or unsupported PDF format from "%(source)s": %(error)s
pt: Formato de PDF inválido ou não suportado de "%(source)s": %(error)s

source: Unexpected error processing the PDF from "%(source)s": %(error)s
pt: Erro inesperado ao processar o PDF de "%(source)s": %(error)s

source: No main text found at "%(url)s". The page might be empty, heavily reliant on JavaScript, or the main content was removed during parsing.
pt: Nenhum texto principal encontrado em "%(url)s". A página pode estar vazia, ser muito dependente de JavaScript ou o conteúdo principal foi removido durante a análise.

source: Error parsing HTML content from URL "%(url)s": %(error)s
pt: Erro ao analisar conteúdo HTML da URL "%(url)s": %(error)s

source: input
pt: entrada

source: Invalid file type for upload.
pt: Tipo de ficheiro inválido para upload.

source: Please upload a PDF.
pt: Por favor, carregue um PDF.

source: Invalid URL format.
pt: Formato de URL inválido.

source: The content at the URL is too large (larger than %(max_size)sMB).
pt: O conteúdo na URL é demasiado grande (maior que %(max_size)sMB).

source: The URL does not point to a supported PDF or HTML page (Content-Type: %(ctype)s).
pt: A URL não aponta para uma página PDF ou HTML suportada (Content-Type: %(ctype)s).

source: Timeout (%(sec)ss) when trying to access the URL: %(url)s
pt: Tempo esgotado (%(sec)ss) ao tentar aceder à URL: %(url)s

source: Network error accessing the URL %(url)s: %(error)s
pt: Erro de rede ao aceder à URL %(url)s: %(error)s

source: No PDF file was uploaded or valid URL provided.
pt: Nenhum ficheiro PDF foi carregado ou URL válida foi fornecida.

source: Could not extract text from "%(source)s" (empty result after processing).
pt: Não foi possível extrair texto de "%(source)s" (resultado vazio após processamento).

source: An unexpected error occurred during processing. Check server logs for details.
pt: Ocorreu um erro inesperado durante o processamento. Verifique os logs do servidor para detalhes.

source: Error: No extracted text found in the current session for download. Please try processing a PDF or URL again.
pt: Erro: Nenhum texto extraído encontrado na sessão atual para download. Por favor, tente processar um PDF ou URL novamente.

source: Invalid download format.
pt: Formato de download inválido.

source: Extracted Text
pt: Texto Extraído

source: Error generating the file for download.
pt: Erro ao gerar o ficheiro para download.

source: {editor}: Editing failed
pt: {editor}: Edição falhou

source: {editor}: Editing failed: {e}
pt: {editor}: Edição falhou: {e}

source: Aborted!
pt: Abortado!

source: (Deprecated) {text}
pt: (Obsoleto) {text}

source: Options
pt: Opções

source: Got unexpected extra argument ({args})
pt: Argumento extra inesperado ({args})

source: DeprecationWarning: The command {name!r} is deprecated.
pt: AvisoDeObsoleto: O comando {name!r} está obsoleto.

source: Commands
pt: Comandos

source: Missing command.
pt: Comando em falta.

source: No such command {name!r}.
pt: Comando {name!r} não encontrado.

source: Value must be an iterable.
pt: Valor tem de ser um iterável.

source: Takes {nargs} values but 1 was given.
pt: Leva {nargs} valor mas 1 foi dado.

source: env var: {var}
pt: var amb: {var}

source: (dynamic)
pt: (dinâmico)

source: default: {default}
pt: predefinido: {default}

source: required
pt: obrigatório

source: %(prog)s, version %(version)s
pt: %(prog)s, versão %(version)s

source: Show the version and exit.
pt: Mostrar a versão e sair.

source: Show this message and exit.
pt: Mostrar esta mensagem e sair.

source: Error: {message}
pt: Erro: {message}

source: Try '{command} {option}' for help.
pt: Tente '{command} {option}' para ajuda.

source: Invalid value: {message}
pt: Valor inválido: {message}

source: Invalid value for {param_hint}: {message}
pt: Valor inválido para {param_hint}: {message}

source: Missing argument
pt: Argumento em falta

source: Missing option
pt: Opção em falta

source: Missing parameter
pt: Parâmetro em falta

source: Missing {param_type}
pt: {param_type} em falta

source: Missing parameter: {param_name}
pt: Parâmetro em falta: {param_name}

source: No such option: {name}
pt: Opção não encontrada: {name}

source: Did you mean {possibility}?
pt: Queria dizer {possibility}?

source: unknown error
pt: erro desconhecido

source: Could not open file {filename!r}: {message}
pt: Não foi possível abrir o ficheiro {filename!r}: {message}

source: Argument {name!r} takes {nargs} values.
pt: Argumento {name!r} aceita {nargs} valores.

source: Option {name!r} does not take a value.
pt: Opção {name!r} não aceita um valor.

source: Option {name!r} requires an argument.
pt: Opção {name!r} requer um argumento.

source: Shell completion is not supported for Bash versions older than 4.4.
pt: Autocompletar da Shell não é suportado para versões Bash anteriores a 4.4.

source: Couldn't detect Bash version, shell completion is not supported.
pt: Não foi possível detetar a versão Bash, autocompletar da shell não é suportado.

source: Repeat for confirmation
pt: Repita para confirmação

source: Error: The value you entered was invalid.
pt: Erro: O valor que inseriu é inválido.

source: Error: {e.message}
pt: Erro: {e.message}

source: Error: The two entered values do not match.
pt: Erro: Os dois valores inseridos não coincidem.

source: Error: invalid input
pt: Erro: entrada inválida

source: Press any key to continue...
pt: Pressione qualquer tecla para continuar...

source: Choose from: {choices}
pt: Escolha de entre: {choices}

source: {value!r} is not {choice}.
pt: {value!r} não é {choice}.

source: {value!r} does not match the format {format}.
pt: {value!r} não corresponde ao formato {format}.

source: {value!r} is not a valid {number_type}.
pt: {value!r} não é um {number_type} válido.

source: {value} is not in the range {range}.
pt: {value} não está no intervalo {range}.

source: {value!r} is not a valid boolean.
pt: {value!r} não é um booleano válido.

source: {value!r} is not a valid UUID.
pt: {value!r} não é um UUID válido.

source: file
pt: ficheiro

source: directory
pt: pasta

source: path
pt: caminho

source: {name} {filename!r} does not exist.
pt: {name} {filename!r} não existe.

source: {name} {filename!r} is a file.
pt: {name} {filename!r} é um ficheiro.

source: {name} {filename!r} is a directory.
pt: {name} {filename!r} é uma pasta.

source: {name} {filename!r} is not readable.
pt: {name} {filename!r} não é legível.

source: {name} {filename!r} is not writable.
pt: {name} {filename!r} não é gravável.

source: {name} {filename!r} is not executable.
pt: {name} {filename!r} não é executável.

source: {len_type} values are required, but {len_value} was given.
pt: {len_type} valor é necessário, mas {len_value} foi dado.

source: PDF & URL Extractor
pt: Extrator de PDF & URL

source: Extract Text from PDF or Web Page
pt: Extrair Texto de PDF ou Página Web

source: Upload a PDF file or provide the URL of an online PDF or a web page to extract the main text.
pt: Faça o upload de um ficheiro PDF ou forneça a URL de um PDF online ou de uma página web para extrair o texto principal.

source: PDF File Upload:
pt: Upload de Ficheiro PDF:

source: Select a PDF file from your computer.
pt: Selecione um ficheiro PDF do seu computador.

source: OR
pt: OU

source: URL (PDF or Web Page):
pt: URL (PDF ou Página Web):

source: e.g., https://example.com/document.pdf OR https://site.com/page.html
pt: ex: https://exemplo.com/documento.pdf OU https://site.com/pagina.html

source: Paste the full URL (including http:// or https://).
pt: Cole a URL completa (incluindo http:// ou https://).

source: Process and Extract Text
pt: Processar e Extrair Texto

source: Processing...
pt: A processar...

source: Processing, please wait...
pt: A processar, por favor aguarde...

source: Results:
pt: Resultados:

source: Waiting for input...
pt: A aguardar entrada...

source: Developed with
pt: Desenvolvido com

source: using Python, Flask, HTMX & Bootstrap.
pt: usando Python, Flask, HTMX & Bootstrap.

source: Error:
pt: Erro:

source: Text extracted successfully from:
pt: Texto extraído com sucesso de:

source: uploaded PDF
pt: PDF carregado

source: characters
pt: caracteres

source: Save Result As:
pt: Guardar Resultado Como:

source: Save as Plain Text (.txt)
pt: Guardar como Texto Simples (.txt)

source: Save as CSV (each text line in a CSV row)
pt: Guardar como CSV (cada linha de texto numa linha do CSV)

source: Save as JSON (list of lines)
pt: Guardar como JSON (lista de linhas)

source: Note:
pt: Nota:

source: Text extraction from web pages might not include content loaded dynamically by JavaScript.
pt: A extração de texto de páginas web pode não incluir conteúdo carregado dinamicamente por JavaScript.
